Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://rkzrhiwxbypqfttoczzj.supabase.co"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Baseline Load Test Phase"
  defaults:
    headers:
      Content-Type: "application/json"
      apikey: "sb_publishable_Gk6mjuBLJAwNejBarnDzSw_zT2ITHy5"
      Authorization: "Bearer sb_publishable_Gk6mjuBLJAwNejBarnDzSw_zT2ITHy5"

scenarios:
  - name: "Classify incoming chat messages"
    flow:
      - post:
          url: "/functions/v1/classify-message"
          json:
            text: "Go away, you worthless slut!"
            sensitivity: "Medium"
